[
    { "id": 1, "country": "India", "location": "Jaipur", "image": "jaipur.jpeg", "overview": "Known as the 'Pink City' due to its distinctly colored buildings, Jaipur is the capital of the Rajasthan state. It is famous for its vibrant culture, majestic forts, palaces, and bustling bazaars. Visitors can explore attractions like the Hawa Mahal, Amber Fort, and City Palace, while enjoying traditional Rajasthani cuisine and experiencing the warmth of Rajput hospitality." },
    { "id": 2, "country": "India", "location": "Varanasi", "image": "varanasi.jpeg", "overview": "Varanasi, situated on the banks of the River Ganges, is one of the oldest continually inhabited cities in the world. It is a major spiritual hub in India, attracting pilgrims who come to bathe in the sacred waters and perform funeral rites. The city is known for its ghats (riverfront steps), temples, and vibrant evening Ganga Aarti ceremonies." },
    { "id": 3, "country": "India", "location": "Goa", "image": "goa.jpeg", "overview": "Goa, on the west coast of India, is known for its beautiful beaches, Portuguese heritage, and vibrant nightlife. It offers a mix of Indian and Western culture, with attractions ranging from ancient temples and churches to lively markets and water sports activities. Visitors can relax on the sandy shores, explore spice plantations, or indulge in the region's delicious seafood cuisine." },
    { "id": 4, "country": "India", "location": "Agra", "image": "agra.jpeg", "overview": "Agra is home to one of the Seven Wonders of the World, the majestic Taj Mahal. This iconic white marble mausoleum was built by Mughal Emperor Shah Jahan in memory of his wife Mumtaz Mahal. Apart from the Taj Mahal, Agra boasts other significant Mughal-era buildings like the Agra Fort and Fatehpur Sikri, making it a major tourist destination in India." },
    { "id": 5, "country": "India", "location": "Kerala", "image": "kerala.jpeg", "overview": "Kerala, located on India's tropical Malabar Coast, is known for its palm-lined beaches, backwaters, and lush landscapes. It offers a serene environment with houseboat cruises on the backwaters, Ayurvedic treatments, and cultural experiences such as Kathakali dance performances. The cuisine of Kerala, rich in spices and seafood, adds to the region's charm." },
    { "id": 6, "country": "India", "location": "Mumbai", "image": "mumbai.jpeg", "overview": "Mumbai, formerly known as Bombay, is India's financial and entertainment capital. It is a bustling metropolis known for its colonial architecture, Bollywood film industry, and vibrant street food culture. Visitors can explore iconic landmarks like the Gateway of India, experience the city's local trains, and enjoy panoramic views from Marine Drive along the Arabian Sea." },
    { "id": 7, "country": "India", "location": "Udaipur", "image": "udaipur.jpeg", "overview": "Udaipur, often referred to as the 'City of Lakes' or the 'Venice of the East', is known for its romantic setting amidst the Aravalli Hills. The city is dotted with shimmering lakes, marble palaces, and picturesque gardens. Visitors can explore attractions like the City Palace, Jag Mandir, and enjoy boat rides on Lake Pichola while soaking in the city's regal charm." },
    { "id": 8, "country": "India", "location": "Kolkata", "image": "kolkata.jpeg", "overview": "Kolkata, formerly Calcutta, is the capital of West Bengal and known for its artistic heritage, cultural festivals, and colonial architecture. It's home to prominent landmarks like the Victoria Memorial, Howrah Bridge, and Dakshineswar Kali Temple. The city offers a blend of traditional Bengali cuisine, literary pursuits, and vibrant markets that reflect its rich history." }
]
